IdeaRS.OpenModel.Geometry3D.Region3D
Represents a region in three-dimensional space included outline (border) and openings.

IdeaRS.OpenModel.Geometry3D.Region3D.#ctor
Constructor

IdeaRS.OpenModel.Geometry3D.Region3D.Outline
Gets or sets the reference to IdeaRS.OpenModel.Geometry3D.PolyLine3D curve of Region3D.

IdeaRS.OpenModel.Geometry3D.Region3D.Openings
Gets or sets the list of references to IdeaRS.OpenModel.Geometry3D.PolyLine3Dopenning curve in the Region3D.